Repository: OpenChain-Project/Specification-Translation-French
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr

source: Process for identifying, recording and/or tracking of FOSS components contained in Supplied Software.
fr: Les processus pour identifier, enregistrer et tracer les composants FOSS contenus dans le Logiciel Fourni.

source: Publicly identify a means by which one can contact the FOSS Liaison.
fr: Indiquez publiquement un moyen simple de joindre le correspondant FOSS.

source: Rationale:
fr: Raison:

source: Requirements
fr: Exigences

source: SPDX or Software Package Data Exchange - the format standard created by the SPDX Working Group for exchanging license and copyright information for a given software package.
fr: SPDX ou Software Package Data Exchange (Echange de Données de Paquet Logiciel) - le format standard créé par le Groupe de Travail SPDX pour les informations de licence et de droits d'auteur pour un paquet logiciel donné.

source: Section 2 introduces definitions of key terms used throughout the specification.
fr: La section 2 introduit les définitions et termes clés utilisés tout au long de la spécification.

source: Section 3 presents the specification requirements where each one has a list of one or more Verification Artifacts.
fr: La section 3 présentes les exigences de la spécification avec pour chacune une liste d’un ou plusieurs --Artéfacts-- de Vérification.

source: Software Staff must have completed FOSS training within the last 24 months (to be considered current).
fr: L'Equipe Logiciel doit avoir reçu cette formation FOSS dans les derniers 24 mois (pour être considérée valide).

source: Software Staff roles and responsibilities pertaining to FOSS compliance specifically and the FOSS policy in general; and
fr: Les rôles et responsabilités de l'Equipe Logiciel vis-à-vis de la politique FOSS en général et de la conformité FOSS en particulier ; et

source: Software Staff - any employee or contractor that defines, contributes to or has responsibility for preparing Supplied Software.
fr: Equipe Logiciel - tout employé ou consultant qui définit, contribue à, ou est responsable de préparer, le Logiciel Fourni.

source: Supplied Software - software that an organization delivers to third parties (e.g., other organizations or individuals).
fr: Logiciel Fourni - logiciel qu'une organisation fournit à des tierces parties (i.e., personnes morales et/ou physiques).

source: The FOSS Compliance role and the FOSS Liaison may be the same individual.
fr: Les rôles de responsable de la conformité FOSS et celui de Correspondant FOSS peuvent être assumés par la même personne.

source: The FOSS management program must be capable of handling common FOSS license use cases encountered by Software Staff for Supplied Software, which may include the following use cases (note that the list is neither exhaustive, nor may all of the use cases apply):
fr: Le programme de gestion des questions FOSS doit être en mesure de gérer les cas d'usage courants de licences FOSS auxquels peut être confrontée l'équipe Logiciel pour le Logiciel fourni, qui peuvent être notamment les suivants (cette liste n'est pas exhaustive et certains exemples peuvent ne pas s'appliquer à votre contexte) :

source: The FOSS policy and where to find a copy;
fr: La politique FOSS et où en trouver une copie ;

source: The OpenChain Initiative began in 2013 when a group of software supply chain open source practitioners observed two emerging patterns: 1) significant process similarities existed among organizations with mature open source compliance programs; and 2) there still remained a large number of organizations exchanging software with less developed programs.
fr: L’Initiative OpenChain a débuté en 2013 quand un groupe de professionnels de l'open source a observé deux tendances émergentes : 1) des similarités significatives existent entre les processus d'organisations ayant un programme de conformité open source mâture ; et 2) il existe encore un grand nombre d’organisations échangeant du logiciel ayant des programmes moins développés.

source: The Vision and Mission of the OpenChain Initiative are as follows:
fr: La Vision et la Mission de l’initiative OpenChain sont les suivantes :

source: The details of the policy and available translations can be found on the OpenChain project specification webpage.
fr: Les détails de cette politiques et les différentes traductions sont disponibles sur le site Web du projet OpenChain .

source: The latter observation resulted in a lack of trust in the consistency and quality of the compliance artifacts accompanying the software being exchanged.
fr: Cette dernière observation a entrainé un manque de confiance dans la cohérence et la qualité des livrables de conformité accompagnant le logiciel échangé.

source: The specification focuses on the “what” and “why” qualities of a compliance program as opposed to the “how” and “when” considerations.
fr: La spécification se concentre sur les qualités des ‘quoi’ et ‘pourquoi’ d’un programme de conformité et non aux considérations des ‘comment’ et ‘quand’.

source: The study group evolved into a work group, and in April 2016, formally organized as a Linux Foundation collaborative project.
fr: Le groupe d’étude a évolué en un groupe de travail, et en avril 2016, organisé formellement en tant que projet collaboratif de la Fondation Linux.

source: The training, at a minimum, covers the following topics:
fr: Au minimum, couvre les sujets suivants :

source: They represent the evidence that must exist in order for a given requirement to be considered satisfied.
fr: Ils représentent la preuve qui doit exister pour considérer une exigence donnée satisfaite.

source: This document is licensed under the Creative Commons Attribution 4.0 International (CC-BY 4.0) license. A copy of the license can be found at https://creativecommons.org/licenses/by/4.0/.
fr: Ce document est diffusé sous la licence Creative Commons Attribution 4.0 International (CC-BY 4.0). Le texte de cette licence est disponible à l'adresse https://creativecommons.org/licenses/by/4.0/.

source: This ensures a practical level of flexibility that enables different organizations to tailor their policies and processes to best fit their objectives.
fr: Ceci assure un niveau --réaliste-- de flexibilité qui permet aux différentes organisations d’adapter leurs politiques et processus pour mieux atteindre leurs objectifs.

source: This set is referred to as the Compliance Artifacts which may include (but are not limited to) one or more of the following: source code, attribution notices, copyright notices, copy of licenses, modification notifications, written offers, SPDX documents and so forth.
fr: Cet ensemble correspond aux Livrables de Conformité qui peuvent inclure (mais ne sont pas limités à) un ou plusieurs des items suivants : code source, notices d'attribution, notices de droits d'auteur, copie des licences, notifications de modifications, offres écrites, documents SPDX et ainsi de suite.

source: Time to perform the role has been allocated; and
fr: Suffisamment de temps a été alloué pour effectuer les tâches du rôle ;

source: To ensure the program is sufficiently robust to handle an organization’s common FOSS license use cases.
fr: Assurez-vous que le programme est suffisamment complet pour traiter les cas d'usage de licences FOSS couramment rencontrés par l'entité

source: To ensure a process exists for creating and managing a FOSS component bill of materials used to construct the Supplied Software.
fr: Assurez-vous qu'il existe une procédure pour créer et gérer une liste des composants FOSS ayant servi à la réalisation du Logiciel fourni.

source: To ensure a process exists for reviewing and identifying the license obligations for each Identified License for the various use cases.
fr: S'assurer qu'il existe un processus pour revoir et identifer les obligations des licences pour les cas d'usage donnés pour chaque Licence Identifiée.

source: To ensure that if an organization declares that it has a program that is OpenChain Conforming, that such program has met all the requirements of this specification.
fr: Assurez-vous, que, si une entité déclare disposer d'un programme conforme à OpenChain, ce programme réponde effectivement à l'ensemble des exigences de la présente spécification.

source: To facilitate global adoption we welcome efforts to translate the specification into multiple languages.
fr: Afin de faciliter l'adoption d'Open Chain au niveau mondial, nous encourageons la traduction des spécifications en différentes langues.

source: Verification Artifact(s):
fr: Point(s) de vérification :

source: Verification Artifacts - evidence that must exist in order for a given requirement to be considered satisfied.
fr: Points de Vérification - preuve qui doit exister pour qu'une exigence puisse être considérée comme satisfaite.

source: Vision: A software supply chain where free/open source software (FOSS) is delivered with trustworthy and consistent compliance information.
fr: Vision : Une chaîne de fournisseur de logiciel dans laquelle le logciel libre et/ou open source est fourni avec des informations de conformité fiables et cohérentes.

source: contains FOSS or other software under an incompatible license interacting with other components within the Supplied Software; and/or
fr: inclusion de logiciels FOSS ou propriétaires diffusés sous des licences incompatibles dans le cadre de leur interaction au sein du Logiciel fourni ;

source: contains modified FOSS;
fr: inclusion de logiciels FOSS modifiés ;

source: contains FOSS with attribution requirements.
fr: inclusion de composants FOSS portant des obligations de mentions de paternité.

source: distributed in binary form;
fr: Distribution sous forme binaire ;

source: distributed in source form;
fr: distribution sous forme de code source ;

source: integrated with other FOSS such that it may trigger copyleft obligations;
fr: intégration avec d'autres logiciels FOSS qui peuvent déclencher des obligations liées au copyleft ;
